= Bluetooth Low Energy技術 をはじめよう

Bluetooth Low Energy技術は、ものとものとがおしゃべりをするような無線通信技術と言えます。では、ものとものとのおしゃべりとは、どのようなもので、また、おしゃべりするものを作ったり活用するには、どうすればできるのでしょうか。本章では、技術の活用について見ていきます。

もしかすると、技術に目がいき、技術を理解していれば、なんでも作れてなんでも考え出せると思うかもしれません。そして、Bluetooth Low Energy技術を隅から隅まで理解したくなるかもしれません。ですが、それは違います。

無線通信規格は、世界にある様々なものがお互いにおしゃべりをするための共通基盤、つまり部品にすぎません。ですから、まず最初におこなうべきは、この無線通信規格を部品として、何に用いるか、どのように活用するかを明らかにすることです。

まず、Bluetooth Low Energy技術と自分との関わり方、そして目的と動機をはっきりさせます。趣味や好奇心あるいは学習や業務あるいは事業立案や製品企画まで、この技術との関わり方は人それぞれです。そして目的と動機がはっきりすれば、その目的から逆に道を辿ることで、その目的にたどり着くまで最短経路と必要な時間がわかります。

次に、Bluetooth Low Energy技術の、すでに今ある利用場面や活用方法を見ていきます。超低消費電力無線通信技術や低い製造費用、さらにはスマートホンとそのアプリケーションと、無線通信規格を基盤にして、いくつもの要素が互いに発展しながら、今あるBluetooth Low Energy技術の活用場面は形作られて来ました。それぞれの活用場面を見ていくことで、この無線通信規格の特徴とその活用方法がよくわかるはずです。

== Bluetooth Low Energy技術との関わり方

無線通信技術を詳しく見ていく前に、自分とのBluetooth Low Energy技術との関わり方を、はっきりさせていきます。関わり方ががわかれば、無線通信規格は部品として使うだけで内部を理解する必要はないのか、あるいはとても詳しく理解する必要があるのかがわかります。そして、個人や学習あるいは事業や業務、それぞれの視点から見える、動機と目的そして目的までの道のりの3つを見てみましょう。

=== 関わり方をはっきりさせよう

まず、ペンと紙を用意して、場所と目的や結果そして動機と、3つの項目を横に書き並べて表を作ります。そして、自分が望むBluetooth Low Enegy技術を活用している場面を思い浮かべてください。

この活用している場面を思い浮かべながら、数分ほどで先ほどの表に書き入れていきます。場所の項目には、自分が何かを作っている場所や活用している場所を書きます。目的や結果の項目には、完成させたものや活用している何かや手に入れた何かなどを、思いつくままに書き並べていきます。最後に、動機の項目に、自分がどのような気持ちや望みで作ったり活用しているのか、自分をかき立てるものを書き並べます。

この表は、自分を自分で客観的に見つめるためのもので、誰かに見せたりするものではありません。自分にわかりさえすれば良いので、どのような書き方をしてもよいものです。文章でなくても、絵を描くのもよいでしょう。何も思い浮かばない、わからないならば、これは時間をかけてよりよい結果が出てくるものではありませんから、悩むことに時間を使わずに、わからないとだけ書いておきます。あるいは、そのわからなさから感じるモヤモヤした感じを、ぐちゃぐちゃとした線の塊で表現しておくのもいいでしょう。

#@# 場所         目的や結果                                        動機　　
#@#----------------------------------------------------------------------------
#@# 自宅    　何かを作る。スマホから動く何か(ラジコンカー)         　　趣味     
#@# 学校      スキル、学習。                                   　好奇心
#@# 会社      自社製品にスマホ連携機能を入れる。　　　　　　　　　　　　仕事だから
#@# 駅や空港   新規製品(落し物検出、スマートロック、カーテン開け閉め)。   健康、安全、見守り
#@#          100億円の売り上げ、

数分もあれば、表1のような表ができます。具体的な項目は人それぞれに大きく異なるでしょう。この表には、自分とBluetooth Low Energy技術との関わり様が現れます。

場所の項目には、作っている場所を思い浮かべていれば自宅や学校あるいは会社が、活用している場所であれば、生活の場としての自宅や人が活動したり集まる場所としての学校や会社あるいは駅や空港が並ぶかもしれません。目的や結果の項目は、まさに多種多様でしょう。例えば、スマートホンから操作するラジコンカーのような具体的なものがあるかもしれません。あるいは、プログラミング学習や、プログラムを作り動かす技能の習得があるかもしれません。形があるものではなく、これまでにない新たなサービスや事業のような、大きな目的があるかもしれません。

個人であれば、作り活用する場所は自宅です。結果にはスマートホンから操作するラジコンカーの様な具体的なものがあるでしょう。その動機は、何かを作りたいという好奇心や趣味です。

これが場所が学校であれば、作る何かは個人と同じ様な形ある何かを、教材を使い作り動かします。ですが、その目的は作ることを通じてプログラミングを学習し技能を習得することであり、またその学習と習得が動機でもあります。

会社であれば、まず事業計画を作りお金を集めて、人を集めて組織化して会社として立ち上げたり、あるいは企画書を作るところから始まり、社内で予算や権限を得て人を集めてチームを作ります。その動機は、製品や事業から十分な利潤を得ることです。

また会社で組織の一員として、事業のうち技術に関わる部分の担当になるかもしれません。検討段階で実験をするために試作品を作ったり、あるいは量産するための製品の設計を担当するかもしれません。その動機は、組織の中での役割を果たすことです。

さて、Bluetooth Low Energy技術と自分との関わりを明らかにしたところで、次は、代表的な関わり方を詳しく見ていきます。

=== 個人

Bluetooth Low Energy技術に個人が興味を持つことは、まずないでしょう。この技術が使われる場面を見て、それを自分でも作ってみたい使ってみたいと思い、そこにこの技術が使われているとは気づかずに使う場面がほとんどではないでしょうか。おそらく、個人が関わるのは、プログラミンング教育や好奇心あるいは趣味への活用でしょう。

Bluetooth Low Energy技術は、プログラミング教育教材や、ラピッド・プロトタイピング向けの電子回路に活用されています。ボタンや傾きの入力と音や光あるいはモータの動きを出力する小さな電子回路があります。この電子回路のプログラムは、パーソナル・コンピュータやスマートホンで組み立てて、Bluetooth Low Energy技術で転送して書き込めます。電子回路単体で動かすこともできますし、スマートホンと無線通信で連携させることもできます。

Bluetooth Low Energy技術は、スマートホンと小さな電子回路とが直接電波をやり取りする近接無線通信技術です。周囲にある他のスマートホンや小さな電子回路が、通信を中継することはありません。電波が届く距離は理想的な条件でも100メートルが限界ですから、個人の利用場面は、スマートホンの画面と、目の届く範囲で動く何かとの組み合わせになります。

#@#組み合わせは3つ。本体のみ。本体-スマホ。スマホ-本体。
#@# プロファイルその1。本体のみ。電子回路の中のプログラムで完結する何か。
小さな電子回路にプログラムを転送して、それ単体で動かす場面はいくつかあります。スイッチと小さな表示器で動くゲームは、パソコンやスマートホンに比べるまでもない小さな表示器ですが、小さな電子回路で動く小さなゲームは、それは独特の楽しさがあります。内蔵するセンサーで外界からの刺激に反応して動く、ものも作れます。加速度に反応して表示を変化させれば、それを手に持って大きく振ると残像で大きな表示が見えます。さらに加速度センサとモータとを組み合わせて、倒れないようにバランスを自分で調整する倒立振子というロボットも作れます。

#@# プロファイルその2。小さな電子回路からスマートホンへの流れ。操作系。ゲーム入力とか。
小さな電子回路とスマートホンとのやり取りが生み出す振る舞いも作れます。電子回路からスマートホンへの一方向の情報の流れなら、加速度情報をスマートホンに伝える仕組みとボクシングゲームの教材とを組み合わせれば、実際の手の動きで遊ぶボクシングゲームが作れます。スマートホンから電子回路への一方向の情報の流れなら、画面に表示されたコントローラの情報と小さな電子回路につながるモータの出力制御とを組み合わせれば、スマートホンから操るラジオ・コントロール・カーが作れます。

#@# 同じハードウェアなのに。プロファイルは、利用場面の定義次第。要素の組み合わせ。振る舞いはプログラム。
加速度センサーというハードウェアでも、加速度と表示器とを連携させれば残像を利用した表示装置にしたり、スマートホンのゲームと連携する操作装置、あるいは倒立振子というロボットなど、同じハードウェアでも、振る舞いを生み出すソフトウェアにより、様々な装置になります。また、これを情報の流れとしてみれば、センサから取得した加速度の情報を、表示器に反映したり、スマートホンに伝えたり、あるいは制御プログラムを通じてモータの出力値にしています。装置の振る舞いは、情報の流れでもあるのです。

#@# 教育も同じ。結論を決めて、そこに至る道、道をさらに分割して、理解可能な要素にまで落とし込む。
このような、パーソナルコンピュータやスマートホンだけはない、私達の世界に広がるプログラミング教育教材は、大げさに言えばプログラムで世界を変える体験です。映画のように、杖を振るだけで目の前の食材がたちどころに料理に変わりはしませんが、ロボット・アームを揃えてプログラムを開発すれば同じことは実現できると疑いなく思えるでしょう。

教材や誰かの作品を見て作りたいと思い、手順通りに組み立てても、動かないかもしれません。例題は動くのですから、自分の組み立てたものが、何かがうまくないのでしょう。まず全体の構成を見て、要素に分けます。要素ごとに動くかを確かめて、そして要素と要素とがちゃんと繋がっていくかを1つ1つ確かめていきます。問対の把握と、それを理解できる小さな領域に分割して1つ1つ確かめる原因調査は、解決方法のよい教育になります。

この体験は、作りたいものを思いついた時にも役立つものです。作りたいものを実現したらどうなるかを考え、それを十分小さな要素に分解して、1つ1つの要素を作り組み立てていきます。例えばボクシングゲームを思いついたとします。小さな電子回路では、加速度を取得する方法、デジタル・データをスマートホンに伝える方法の2つの要素があります。あとは、ボクシングゲームにその情報を渡す方法を調べればよいのです。

=== 開発者

個人では、動機や目的あるいは手を動かすのも、自分のものでした。開発者は、誰かが望むものを誰かの依頼を受けて完成させます。また開発は、周辺機器やアプリケーション、あるいは電子回路やソフトウェアと、それぞれの領域をそれぞれの開発者で分業して、複数の開発者で構成したチームで進めます。

開発者の目的は、開発業務への従事や開発成果物の納品で、金銭などの利益を得ることです。開発者に支払われる報酬は、起業であれば資本金から、すでに事業化していればサービスや製品の売り上げから支払われますから、開発者はサービスや製品と常に関わることになります。設計して製造されたものは、世界のどこかで会ったこともない数多くの人達に長い期間使われて、そして最後には破棄されて寿命を終えます。開発者の責任は、設計すれば終わりではなく、それが十分に使われて破棄されるまでです。

開発者チームのなかに、Bluetooth Low Energy技術それ自体の専門家がいることは、あまりありません。どの開発者も、それぞれの担当領域のなかに、Bluetooth Low Energy技術を部品として使いこなす部分が少し入ってきます。周辺機器の担当ならば、無線通信回路やファームウェアへの通信制御の実装として、Bluetooth Low Energy技術に関わります。スマートホンのアプリケーションが担当ならば、仕様書に記載された通りに、機器の発見と読み書きの機能を呼び出すだけでしょう。

また、たいていのサービスや製品では、開発全体でBluetooth Low Energy技術に費やす時間は、とても小さなものです。これは、無線通信技術それ自体を開発するのではなく、無線通信というものを部品として利用するだけだからです。WiFi接続設定や製品の初期設定など、製品を使い始める時に1回だけしか使わない製品も多いでしょう。

#@# プロファイルは誰が作る。みんな? ブレインストーミング。製品開発、アイディア。新規。すでにある。
最初のアイディアは、どこで出てくるのでしょうか。個人のように好奇心がきっかけになることはあっても、大きなお金や費用が動くサービスや製品の開発が、好奇心だけで動いたりはしません。電化製品の製造販売の会社で、経営方針として、これからはスマートホンと連携させると決まるかもしれません。あるいは製品企画で、目新しさとしてスマートホンとの連携だと提案が持ち上がるのかもしれません。もしかすると、近づくだけでスマートホンのアプリケーションが反応するらしいから、それならこんなサービスができないかと、あやふやな見聞から、閃いてしまうのかもしれません。

#@# アイディアから、試作そして製品開発へ。
アイディア出しからプロトタイピング、製品開発そして製造販売へと段階が進みます。段階が1つ進むごとに、費用や時間の規模は10倍あるいは100倍と桁上がりで大きくなります。また、アイディアとしてよいと思えても、実際に体験してみると思ったものと異なったり、あるいは技術要素が思った振る舞いをしないかもしれません。ですから、プロトタイピングなどの手法を用いて、アイディアを検証します。

#@# プロトタイピングまで開発者がいないことはよくある。そこに開発者として参加するならその役割は
アイディアを出してプロトタイピングをして、予算権限や出資者の合意を得て初めて、開発者を集める予算や資金が確保できます。そのため、アイディア出しとプロトタイピングに開発者がいないことも、よくあるでしょう。アイディア出しとプロトタイピングで、開発者として参加する時に求められるのは、設計や開発ではありません。技術知識を背景にした1つの視点からの提案や意見、また体験としての実現可能性の判断などです。

#@# 必ずしも作ることとは限らない。
プロトタイピングといっても、必ずしも電子回路やソフトウェアを作るとは限りません。そのアイディアが実現した場面を紙芝居にして、色々な人に見てもらい感想を集めるかもしれません。あるいは人が黒子になったり、あるいはごっこ遊びの形で、アイディアを再現して体験してもいいでしょう。その場面を動画に記録して観察するかもしれません。

#@# 技術の振る舞いと、実際の予想の不一致は、技術の方に部があるから、プロトタイピングは重要。
プロトタイピングの段階で、開発者がいなくても教育用教材やプロトタイピング向けの書籍や電子回路を活用するなどして、ほんの1部の機能でよいので、実際に動く電子回路やソフトウェアを作り体験を確認します。アイディアを出すときに想定していた技術の振る舞いが、実際には想定とは振る舞いが異なり、そのままのアイディアは実現はできないことがよくあります。プロトタイピングは、早い段階で実現可能性を確認することで時間と費用の節約になります。
#@# 事業的の視点

#@# 技術のちょっとした聞き間違いが、大変なことになる。作れるものしか作れないということ。
例えば、Bluetooth Low Energy技術が無線通信し続ける技術だと聞いて、無線通信の接続と切断を、忘れ物や落し物を防止する小さなタグに利用するとします。このアイディアをそのまま実装すると、忘れ物や落し物の警告が頻繁に出てきて、とても普段使いできるものではなくなります。これは、Bluetooth Low Energy技術の無線接続は、雑音や周囲の電波状況などで、簡単に切断するものだからです。では無線通信し続ける振る舞いとはなんなのだといえば、簡単に切断しますが、またすぐに接続し直すから、見た目には無線通信が維持されます。これは、ヘッドホンのように音声や音楽のデジタル・データが常に流れ続ける用途では不適切な振る舞いですが、Bluetooth Low Energy技術は、低頻度で少量のデジタル・データを伝える技術なので、この振る舞いで、見た目では無線通信が維持されるのです。

#@# 製品化では開発者を集める。
プロトタイピングをうけて、試作そして量産を前提とした設計に進みます。ここで開発者のチームを組み、分担を決めて作業を進めていきます。試作では、実際に筐体と電子回路を開発して、スマートホンのアプリケーションと合わせて基本的な機能を確認していきます。この時点で、スマートホンとの連携動作の確認も取ります。試作の次は、量産を前提とした製品の設計に進みます。筐体の機構設計や電子回路そしてソフトウェアの開発はもちろん、一般的な製品開発、安全性検証から説明書の作成、また製造ラインを作り販売国での電波法の認証取得、そしてBluetooth SIGへの製品登録やサポート・マニュアルの作成と、項目は多岐に渡ります。

=== 事業化

私達の身の回りにある、ものやサービスは、様々な会社が営む事業により提供されています。事業は、営利を目的として営む経済活動です。経済活動に必要な様々なものや多様な人そして大きなお金などの資源を管理して、金銭的な利益を目的として活動する組織が会社です。事業のこの技術との関わり方は、この技術そのものが事業となるもの、事業に役立てるもの、そして事業の新たな可能性とするものの、3つがあります。

#@# BLEそのものが事業な、動機と目的そして目的までの道のりの3つ
Bluetooth Low Energy技術そのものが、いくつもの事業により支えられています。Bluetooth無線技術の規格を作り、特許や商法を管理する団体 Bluetooth SIG は、会費や製品登録料を収入源としています。Bluetooth Low Energy技術に欠かせない、半導体や電子部品、あるいはプロトコル・スタックや開発環境などのソフトウェアを設計製造する会社もいくつもあります。

Bluetooth Low Energy技術を支える事業は、売り上げの増加のために、この技術が用いられる分野をさらに広げようとします。また、それぞれの分野で、この技術を採用する製品数を増やして、この技術をその分野で最も使われる無線通信技術にしようとします。Bluetooth Low Energy技術が、これまでに無線通信技術が使われてこなかった分野に向けて開発されているのは、この事業の求めに答えています。無線通信技術を採用しようとする分野を、規格や技術で制約しないように、多種多様なものを表現する柔軟な能力を持たせています。製品への採用で部品価格は常に注目される要素ですから、部品価格が安価になるように、規格で工夫されています。

Bluetooth無線技術は、囲い込まれた技術ではありません。規格を提供する団体 Bluetooth SIGに参加することで、この技術を担う半導体やソフトウェアを開発販売できます。また次世代の規格開発に参加することすらできます。たいていは、売り上げを増やし市場での自社製品の比率を高めるのに、権利化された自社のみが提供できる技術は、大きな強みです。ですが、無線通信には通信相手が必要です。お互いに通信しあう多種多様な製品群を生み出すためには、無線通信技術を囲い込んではならないのです。

Bluetooth Low Energy技術を支える事業は、この技術を使いやすくすることで競争をしています。無線通信の半導体では、年間ライセンス料金が数十万円する組み込み機器の開発者向けの統合開発環境を自社製品のソフトウェア開発向けに無償提供をしたり、誰でもが参加できる開発情報のフォーラムを解説して開発の質問に直接答えるなど、開発を容易にしています。

#@# 事業に役立てるもの。動機と目的そして目的までの道のりの3つ
Bluetooth Low Energy技術は、つい最近登場した新しい技術です。世の中のほとんどの事業は、この技術が登場する以前からあるのですから、世の中のほとんどの事業は、この技術がなくても成り立ちます。それでも事業がこの技術を活用するのは、経費をより小さくできるか、売り上げを大きくできるかの、いずれかの場合です。

事業所に導入する入退室管理用の鍵システムが、たまたまBluetooth Low Energy技術を活用しているかもしれません。機密情報がある場所には権限がある人しか入れないようにするのに、通常の鍵で運用すると、紛失対応が必要になったり、あるいは鍵の複製を作られたり第3者にこっそり渡される可能性への対処も必要です。高度な生体認証機能があるスマートホンを鍵にして、そのような手間を削減しているかもしれません。

また鍵の製造販売の会社ならば、製品にBluetooth Low Energy技術を取り入れて、売り上げを伸ばせるかもしれません。スマートホンが使える目新しい製品として、新しいものを好むところに売れるかもしれません。入退室の権限設定と入退室のリアルタイムな記録システムもあれば、運用経費を削減したい事業所が購入するかもしれません。

#@# アプセサリ的な、事業変化の、動機、目的、そして目的までの道のあり。
新技術の登場と普及で、それまで困難であったり不可能なことが可能になることがあります。Bluetooth Low Energy技術は、すでに広く普及しているスマートホンと私達の世界との間にある1メートルの空間を飛び越える強力な技術ですから、事業と組み合わせれば、その活用は無数にあるでしょう。

ですが、新技術が登場しても私達の生活が一晩で変わることはありません。考え方や生活習慣は、それほどすぐには変化しないからです。新技術を活用した何かが登場しても、それを使うのは目新しいものを好むごく一部の人達だけです。ですが、ある時期を境にして、その何かがあることが当然かのように、急激な普及と変化が起きることがあります。そのような変化は、事業から見れば、事業は同じなのに、人々がお金を使う場所が突然切り替わるように見えます。

スマートホンがまだなかった1990年代に、長距離の電車移動をしようとすれば、まず駅前の旅行代理店に行き、電車の時刻表をたぐり乗り換え経路を調べてもらい、専用端末で切符を発券してもらうのに、半日はかかりました。現代であれば、スマートホンを取り出して5分もあれば完了する単なる作業です。

今では多くの人が、店舗以外で移動や宿泊の予約をします。それまでは駅前の立地のよいところに店舗を構える事業が、ネットワークを通じたサービスとなり、人々はそこでお金を使うようになります。このような新技術の普及が人々の消費活動の場を変えてしまう場面では、その分野で先駆者になる必要はありませんが、他社に後れを取れば売り上げを失います。

Bluetooth Low Energy技術の活用は、事業を変化させるかもしれません。鍵の製造販売の会社が、Bluetooth Low Energy技術を取り入れて、スマートホンで開閉できる新製品を開発したとします。これだけであれば、スマートホンのアプリケーションで操作できる鍵でしかありません。しかし、鍵というのは、所有や利用の権利を形にするものと見ることもできます。権限があるから事業所の鍵を開けて入室できるのでしょうし、支払いをしたからホテルの部屋の鍵を開けることができます。単なる新製品の鍵が、そのような権利や所有を扱う管理システムを開発して提供したり、ネットワークを通じたサービスを提供し始めれば、鍵というものを通じて、権利や所有を扱う事業へと姿を変えるでしょう。

=== 関わり方のまとめ

ここまでで、Bluetooth Low Energy技術と自分との関わり方を、場所、目的や結果そして動機という3つの項目で表にまとめ、また代表的な関わり方を3つ示しました。この大まかな区分でも、自分とBluetooth Low Energy技術の関わりと、理解の必要がある知識や分野が明確になったと思います。

ここでは、立場や役割を個人と学習そして事業者と3つに分けましたが、必ずしも1つの役割だけをするわけではないでしょう。初めは個人として、思いつくだけの試みを行い、それが学習につながり、やがて事業を手がけることになるかもしれません。

思いついたアイディアが本当によいものかを確かめるには、個人として素早く試作と実験を繰り返すでしょう。あるいは試作せずに、絵本や演劇でアイディアが実現したと想定した場面を撮影して、それを見ることで確かめようとするかもしれません。これは確かめるという結果を得るために、最も手間がかからない方法を選択するのです。ですから、すぐに壊れてしまったり、ほんの一部の機能しか実装されていなくても、よいのです。求めるものは、ある期間で実験をより多く繰り返し、あるいは探求を深めていくかであり、そのためには素早く作り素早く変更することが必要になります。

アイディアが事業の規模で実現ができると確信が得られれば、次は開発者の役割になるかもしれません。最初の1つを販売するまでに、開発者にはとても多くの仕事があります。設計は、妥当な品質と価格で大量生産が可能でなければなりません。人や物に害を与えない安全性が検証されていて、国ごと製品分野ごとの規格認証を取得しなければなりません。販売される製品は世界に広がり、会った事もない誰かが、知らない場所でそれを使い続けるのです。その製品が破棄されるまで、利用者が満足することはもちろんですが、安全に使われるかは、設計次第です。

アイディアが実証できれば、次の段階へと進めるために、資金を集めて会社を起こしたり、あるいは社内新規事業を立ち上げるでしょう。開発はもちろん、財務や法務に営業や広報それに流通や在庫管理やユーザ・サポートと、事業に必要な人材を集めてチームを作っていきます。アプセサリでは、ハードウェアとソフトウェアという分野の異なる2つのものを作りしかも連携させねばならないので、うまく機能する開発チームを作ること自体が、挑戦になるかもしれません。

開発者が、素晴らしいアイディアや技術的に困難だが挑戦しがいのあることを、新たに見つけて、それを手がけたいと好奇心にとりつかれるかもしれません。まず最初の1つの製品の販売にすら届いていないのに、さらに新たなアイディアに着手すれば、1つも製品を売ることもなく資金が底をつくでしょう。自ら問題を見つけて行動できる活発な人材の目線を、事業という1つの目的に向けるのは、それだけで1つの大仕事です。

ここまでBluetooth Low Energy技術の活用に着目してきましたが、少し視点を変えて、なぜ私達は活用を考えてきたのでしょうか。それは、Bluetooth Low Energy技術が、用途を制限することがない技術だからです。Bluetooth Low Energy技術を軸にして、ものとものとがおしゃべりをする共通基盤があります。ですが、その共通基盤をどのように使うのかは、私達自身で取り組むほかないのです。

== Bluetooth Low Energy技術の活用場面

Bluetooth Low Energy技術は、すでに私達の日常生活のなかで、広く使われています。もしも私達の耳に Bluetooth Low Energy技術の電波が聞こえたならば、きっとその騒がしさに驚くでしょう。この技術の第行的な利用場面として、まず周辺機器、アプセサリ、そしてビーコンの3つを取り上げ、みていきます。

=== 周辺機器
#@# 技術要素にからめて、必然性を示してね。
Bluetooth Low Energy技術は、ワイヤレスのキーボードやマウスあるいはペンシルといった周辺機器に使われています。ワイヤレス周辺機器が無線通信技術に求めるものは、送るべきデータを素早く送れること、電力消費量の小ささ、そして汎用に使えることです。

周辺機器は、操作データが素早く届かなければなりません。キーボードのキーを押して、それが画面に反映されるのが目に見えて遅くては、入力操作がとても不愉快なものになります。では、どのくらい早ければいいのでしょうか。1画面の表示期間は、画面表示更新頻度が1秒に60回とすれば、約17ミリ秒(1ミリ秒は、1000分の1秒)です。ですから、2~3画面の表示更新よりは小さいとすれば、30ミリ秒が目安になりそうです。

電力消費量は小さければ小さいほど、電池交換や充電の手間が減りますから、好ましいです。特に、ペンシルのように本体が細い軸形状のものは、その本体の中に収められる電池はとても小さなものになりますから、電力消費量の小ささが求められます。ただし、例えば光学式マウスには移動距離を検出するための光学式センサがあるように、周辺機器それ自体の消費電力がありますから、それに比べて無線通信による消費電力が極端に小さくしても、全体の電力消費力はあまり変わりません。電力消費量の大きさが必要を満たしていればよいのです。

周辺機器は、周辺機器として使うものです。キーボードを購入したら、パーソナル・コンピュータやスマートホンに接続して、すぐに使えるべきです。特別なソフトウェアをインストールしなければ使えなかったり、あるいは特定の限られたアプリケーションでしか使えないものでは、困ります。このためには、パーソナル・コンピュータやスマートホンのオペレーティング・システムに、周辺機器を扱う機能が実装されていなければなりません。

Bluetooth Low Energy技術は、少しのデジタル・データを、送るべき時に素早く送れる無線通信技術です。その名前にLow Energyとあるように、超低消費電力無線通信技術を特徴としています。これはデジタル・データを送り続けることが超低消費電力なのではありません。例えば、キーボードであれば、データを送るのはキーが押されたり離された瞬間だけです。デジタル・データをやり取りすることではなく、デジタル・データをいつでも送り届けられる、無線接続した状態を超低消費電力で維持できるのです。

周辺機器が周辺機器として汎用に使うためには、データの意味や機器の振る舞いが1つに統一されていること、そして無線通信技術の後方互換性が維持されることが必要です。

Bluetooth Low Energy技術の汎用性を支えるのは、機器の振る舞いやデータの意味の定義をまとめたプロファイルと呼ぶ仕様です。プロファイルは、機器の種類ごとに作られます。Bluetooth Low Energy技術は、多種多様なものをデジタル・データとして表現する強力な仕組みを備えています。ですが、例えばキーボードのデータ表現が会社それぞれに異なっているとどうなるでしょうか。オペレーティング・システムは、キーボードという1つの分野をサポートするために、会社それぞれのデータ表現の全てに対応しなくてはならなくなります。このようなことにならないように、プロファイルがあるのです。

周辺機器が、新製品として発表されてから製造中止になり、最後の製品が破棄されるまでは、とても長い期間になります。Bluetooth Low Energy技術は、新たな利用場面に向けて次々と規格を更新し続けていますが、無線通信技術が更新されたから、ものが使えなくなるのでは本末転倒です。そのために、Bluetooth Low Energy技術の無線通信技術とプロファイルは、後方互換性が維持できるように考慮され、後方互換性の維持を行なっています。

=== アプセサリ

Bluetooth Low Energy技術の登場により、スマートホンのアプリケーションと周辺機器との連携が新たな価値を生み出すと、認識されてきました。その新たな価値を表すために、連携に価値がある周辺機器を特に、アプリケーションとアクセサリとを組み合わせたアプセサリという造語で呼びます。

アプセサリの代表例が、フィットネスのアプリケーションと、それと連動するリストバンド型デバイスです。リストバンド型デバイスは、装着者の情報を取得する加速度センサや光学式脈拍センサなどの各種のセンサと、小さなディスプレイを備えていて、装着中は常に心拍や活動量を記録し続けます。この情報は、スマートホンのアプリケーションに逐次同期されて、フィットネスや健康管理のサービスに使われます。

Bluetooth Low Energy技術には、無線接続している状態でスマートホンに心拍情報を伝える周辺機器の、定義されたプロファイルがあります。そのプロファイルを実装した周辺機器も販売されています。そのような、単なる周辺機器とアプセサリとを比べると、使われるセンサや機能に違いはありません。アプセサリがアプセサリと呼ばれるのは、アプリケーションとの連携が新たな価値を生むからです。

従来からあるデバイスは、運動時に利用者に心拍数を見せてくれます。その瞬間の心拍数を見て、ペースをもう少し早くあるいは遅くしようと調整するために使いますから、過去の心拍数を記録しておく必要はありません。もしも記録しても、リストバンド型デバイスの小さな表示器では、小さな折れ線グラフを表示するのが精一杯です。データを記録しても、デバイス単体では利用場面を作れません。

強力なデータ処理能力と豊かな画面表示ができるスマートホンのアプリケーションと連携すれば、ランニングであれば、これまでの記録を美しいグラフに表示したり、心拍数から運動能力の変化も可視化するでしょう。トレーニング中に限らずに、常時連続記録されたデータからは、1日の消費カロリーをより正確に算出もできます。夜間の活動量と心拍変化からは、睡眠時間や眠りの深さも算出して可視化できます。データに、スマートホンのアプリケーションの強力な演算能力と豊かな画面表示機能とを掛け合わせれば、いくつもの利用場面が生み出せるのです。

つまり、アプセサリの連続記録されたデータが価値の源泉です。Bluetooth Low Energy技術は、超低消費電力で無線接続状態を維持し続けられる技術ですが、アプセサリとスマートホンとが常に接続するわけではありません。スマートホンを家に置き忘れたりして通信可能距離よりも離れたり、多くの人で混雑している無線通信が激しく飛び交うような場所では、無線接続は容易に切断します。価値あるデータを、通信が途切れていたから失いましたでは、困ります。ですから、アプセサリにはデータを蓄積する機能が必要になります。

アプセサリには、カスタム・プロファイルが使われます。キーボードのように、どのスマートホンでも、どのアプリケーションからでもキーボードとして使えなければいけない周辺機器には、オペレーション・システムがサポートするために、定義されたプロファイルが必要でした。ですが、アプセサリは、サービスを担うアプリケーションとだけ連携します。ですから、サービスに適したプロファイルを定義して、アプセサリとそのアプリケーションの間でだけやり取りをします。

Bluetooth Low Energy技術のプロファイルは、柔軟です。周辺機器の製造だけをするならば、必要な振る舞いが定義された認証されたプロファイルを採用して、汎用的な周辺機器が製造できます。アプセサリとアプリケーションとを開発してサービスを提供するならば、必要なプロファイルを自分達でカスタムして実装できます。あるいは認証されたプロファイルの中に、作ろうとしている振る舞いがすでにあるならば、認証されたプロファイルをさらに追加することもできます。この柔軟さが、Bluetooth Low Energy技術、を多種多様なものに使える無線通信技術にしています。

==== ビーコン

Bluetooth Low Energy技術は、通信相手を探すために、デバイス名などの情報を表すパケットを周囲に送信するアドバタイジングという機能があります。そのデバイス名の代わりに、何かの識別情報をのせてアドバタイジングすれば、電波標識つまりビーコンになります。受信したアドバタイジング・パケットから識別情報を読み取れば、そのビーコンの電波が届く領域に入ったとわかります。また受信信号の強度から、ビーコンとの距離を大まかに推定できます。

このビーコンの振る舞いは、iOSではiBeacon @<href>{https://developer.apple.com/ibeacon/} 、AndroidではEddystone @<href>{https://github.com/google/eddystone} と、スマートホンのオペレーティング・システムごとに定義されています。つまり、オペレーティング・システムが決めるカスタム・プロファイルというわけです。
もしもビーコンが、特定の1つのアプリケーションでだけ使えるものでは、そのビーコンの利用場面は1つだけです。ですが、オペレーティング・システムが機能を提供するならば、ビーコンと組み合わせる利用場面は無数にあり、多種多様な体験を生み出せます。

例えば、美術館にビーコンを設置したとします。屋内配置図とビーコンの識別子と設置位置とを、屋内位置データとして提供すれば、地図アプリケーションが屋内案内に使うかもしれません。展示解説のアプリケーションを新規開発する時に、近くにある展示物の検出に活用できるでしょう。あるいは、iOSでクーポンやチケットを管理するPassbookは、チケットと関連づける位置情報としてビーコンの識別子が使えますから、オンラインで事前購入した入場券が入り口で自動的に表示される自然な体験にも使えるでしょう。

ですが、多種多様な振る舞いを生み出せる範囲は、そのオペレーティング・システムの中でしかありません。幸いなことに、スマートホンのオペレーティング・システムは、iOSとAndroidの2つで占められていますから、カスタムプロファイルも2つ対応すればよいのですが、ですが手間はかかります。ビーコン設置では、この2つのオペレーティング・システムのいずれにも対応したものか、あるいはそれぞれに対応するビーコンを2つ設置せねばなりません。

では、仮にビーコンが、認証されたプロファイルを先に作っていたとすればどうでしょうか。おそらく、今のように広くビーコンが使われることはなかったでしょう。プロファイルは、それが特定の企業やサービスに偏るものではない一般化されたものかなど、慎重に議論されて、指摘を反映して改訂版を何度も作るため、認証には年単位の時間がかかります。特に、使われる分野や利用場面がとても広い位置情報では、誰もが合意する一般化されたプロファイルは、全ての要望を取り入れれば複雑怪奇なものになり、かといって簡素に切り落とすと合意できない利用分野も出てくるなど、認証までに長い時間がかかるでしょう。

iBeaconの仕様を見ると、識別子は1つの16バイトの識別子と2つの16ビットの整数で構成されていて、極めて簡素です。これは一般化された位置情報とみなす人はいないでしょう。ですが、今まで見てきたように、スマートホンが関わる場面では、この簡素な識別子で十分に利用場面が生み出せます。サービスの公開にカスタム・プロファイルは使えます。

=== まとめ

周辺機器として取り上げたのは、ハードウェアだけを作ればよいもので、アプリケーションやサービスまで作る必要がない場面です。個人であれば、ワイヤレス・キーボードの自作キットを購入して、自分の好みにあうキー配置や押し心地のキーボードを組み立てるなど、組み立てたり作る楽しみがあります。開発者として関わると、Bluetooth Low Energy技術の半導体を開発会社に採用してもらうために、周辺機器の基本機能は半導体開発会社が提供しています。いちから開発することなく、用意された開発資源が利用できます。事業であれば、周辺機器という機能は変えようがありませんから、使い心地のよい製品を開発したり、妥当な価格で用意に入手できるよう在庫と流通管理をしっかりとして、利用者サポートに注力し、広告宣伝を十分に行うことになります。

アプセサリとして取り上げたのは、周辺機器とアプリケーションとの連携が価値となる場面です。個人であれば、教育用教材を活用して、スマートホンから操作するラジオコントロール・カーを組み立てたりするでしょう。開発者として関わると、周辺機器単体のソフトウェアと、スマートホンのアプリケーションの2つのソフトウェアの2つを開発して、しかもしれらが連携せねばならないため、どちらも開発できる希少な開発者を探すか、もしくは複数人のチームでの開発になります。同じソフトウェアといっても開発分野が異なれば考え方も異なりますから、チームとして一体となり成果をあげるのは、簡単なことではありません。事業であれば、開発がうまくいき最初の1つが売れても、そこから、その価値に気づいた人達が話題にして開発費用が回収できるほどの売り上げになるまでに、3年はかかるでしょう。その期間を会社が運営できるだけの資金を集めて、開発や営業などの担当者を雇用し続けなければなりません。

ビーコンとして取り上げたのは、周辺機器はすでに設置されていたり、あるいはどこかから購入できるもので、アプセサリのように周辺機器の開発をしなくてもよく、スマートホンのアプリケーションやネットワーク・サービスに注力できる場面です。個人であれば、自分があったらいいなと思う何かの機能を実装するかもしれません。開発者として関わると、アプセサリの場合のように周辺機器の機能と連携まで開発することはなく、スマートホンのアプリケーションやネットワークサービスという、スマートホンを通じて提供するサービスでは一般的な開発になります。Bluetooth Low Energy技術を使うといっても、特に問題にはなりません。事業では、周辺機器の開発という障壁はないため、競争相手の参入が容易です。ビーコンの設置と利用の権利を確立して他社が参入できないようにした上で、競合よりも利用者に選ばれるサービスを提供し続けるほかありません。

== それは正しい無線通信技術の選択なのか
#@# 通信相手はなにになるのか、何か作ったものの通信相手は?
#@#     通信の距離。周波数。専用か、共有か。周波数の幅、領域。
#@#         920MHz、2.4GHz、携帯やポケベル、5GHz。ISM。オークション。
#@#         通信の領域と帯域。どっちが制約? 
#@#     電池交換の手間、メンテナンス、交換。動かなくなるものは、嫌がられる。
#@#     相手はすでにあるものか、新設するのか。月額、維持管理。
#@# BLEの特徴は
#@#     "どこでも使える"の意味。自分と一緒にあるものには最強かも。
#@#         向いていないのは、体重計とか。
#@#     OOB、WiFiの初期設定とか、一回しか使わない近距離通信的なもの。(NFCでもいいけど)
#@#     クラシックとの違い。ドライバ層、アプリ層。作りの違い。
#@#         オーディオに使えるかと言えば。今はNoかも? 問いかけで返答が異なる。




== もう少し詳しい仕組み的な話

#@# 規格の話。4.0で、後方互換性のないものを入れた。そのあとは、互換性を保つ、ややこしい。
#@#     メジャー番号は物理。暗号化とかパケットの長さが変更、ソフト的なもの。認証は5に。
#@#     長距離と高速。方向の検出。ビーコンの拡張。
#@# アプリ後世から見たスタック的な話。技術の特徴とその実装。作るもの。
#@#     BTクラシックとGATTベース。
#@# 通信するものどうし=電波の届く範囲。それらのノードがネットワークを作るもの。システム。
#@#     HomeKit、メッシュネットワーク、
#@# 手が出せるもの、出せないもの
#@#     誰からの仕組みにつながる何か。(手を出せない、従う)。
#@#     アプリ+デバイス、カスタムプロファイル。外部購入。身に付けた加速度,意味づけ。

=== iPhoneとアプセサリ

世界で初めてBluetooth4.0に対応した機器は、2011年に発売されたiPhone 4Sです。それ以降、iPhoneも含む、全てのApple社製品がBluetooth low energy技術に対応しています。またiPhone 4Sに搭載されたiOS5のソフトウェア開発キットは、CoreBluetoothフレームワークを通じて、アプリケーション開発者にGATTプロファイルを開放しました。

ちょうど、iPhoneのアプリケーション開発キットとアプリストアが広く公開されて、個人や会社が様々なアプリケーションを販売するエコシステムが構築されたように、Bluetooth Smart機器の急速な普及もiPhoneを中心としたエコシステムによるところが大きいのです。

ここでは、iPhoneを中心としたBluetooth low energy技術の活用事例を見ていきます。

==== 従来版Bluetooth無線技術とiOSデバイス

iOSを搭載するiPhone、iPod touchおよびiPadなどをiOSデバイスと総称します。iOSデバイスの従来版Bluetooth無線技術での周辺機器は、キーボードやヘッドセットなどの一般的な周辺機器か、特定のiOSアプリケーションとだけ通信する専用周辺機器かの、いずれかのみが開発できます。

デバイス・ドライバをインストールして周辺機器を追加できるパーソナル・コンピュータとは異なり、iOSにユーザがインストールできるのは、アプリケーションのみです。ですから、iOSデバイスが対応するBluetoothプロファイルの周辺機器のみが利用できます footnote:[iOS：iOS デバイス対応の Bluetooth プロファイル, @<href>{https://support.apple.com/ja-jp/HT204387}]。

従来版Bluetooth無線技術で、プロファイルが定義されていない独自の機器には、シリアル・ポート・プロファイル ( Serial Port Profile, SPP )が使われます。シリアル・ポート・プロファイルは、その名前の通り、パーソナル・コンピュータのシリアル・ポートに相当する任意のバイナリ通信を提供します。

従来版Bluetooth無線技術でも、iOSデバイスとつながる独自の機器は開発できます。ですが、iOSはアプリケーションに、シリアル・ポート・プロファイルを開放していません。従来版Bluetoothを使うiOS周辺機器開発は、Apple社と Made for iPhone(MFi)プログラム と呼ばれる秘密保持契約を締結して、開発情報や開発機材の提供をうけて初めて開発できます。Bluetooth Smart機器をアプリケーション開発者に開放した現在でも、従来版Bluetoothの周辺機器はMFiプログラムに参加しなければ開発できません。

==== iOSとBluetooth Smart機器

2011年に発表されたiPhone4Sは世界で初めてBluetooth Smart機器に対応した端末です。そして、アプリケーション開発キットに含まれるCoreBluetoothフレームワークを通じて、一般アプリケーション開発者に、Bluetooth Smart機器と連携するアプリケーション開発が開放されました。

これは、ちょうどAppStoreが登場してアプリケーションの販売とアプリケーション内課金という収益が得られる場が生まれたことで、急激に数多くのiOSアプリケーションが登場した様子に似ています。

iOSとBluetooth Smart機器とのプロファイルには:

- 採択済みプロファイル
- カスタム・プロファイル
- iOS独自のプロファイル

の3つがあります。

キーボードなどの入力機器には、HID Over GATT Profile (HOGP) footnote:[HID Over GATT Profile (HOGP), @<href>{https://developer.bluetooth.org/TechnologyOverview/pages/hogp.aspx} という採択済みプロファイルがあります。このHOGPは、従来版Bluetoothの、ヒューマン・インターフェイス・デバイス・プロファイル (Human Interface Device Profile, HID)を、GATT基盤アーキテクチャに移植したものです。

iOSはこのHOGPに対応していて、キーボードの接続をiOSが受けつけます。アプリケーションは、タッチパネル入力かキーボード入力かを区別することなく、文字入力機能を利用できます。また、iOSが管理しているプロファイルは、一般アプリケーションからは、CoreBluetoothフレームを通じても見えません。

キーボードは、アプリケーションがBluetooth Smart機器に直接接続する意味がない好例です。アプリケーションが必要とするものは文字入力機能であり、キーボードのキー情報の詳細ではありません。たとえキー入力が取得できたとしても、それを文字入力機能とするには、漢字仮名変換などiOSが元来提供している基本機能を、アプリケーション側に実装しなければなりません。

カスタム・プロファイルを利用するアプセサリについては、既に述べました。CoreBluetoothフレームワークを通じて、アプリケーションはBluetooth Smart機器との接続に、高い自由度を与えられています。

まず、ユーザが設定するほかないWiFiなど他の無線インタフェースと違い、Bluetooth Smart機器の検索と接続および切断を、アプリケーションで行えます。そして、アプリケーションが画面に表示されていないバックグラウンド状態でも、Bluetooth Smart機器との通信を続けられます。

この高い自由度を活かして、特にフィットネスや健康維持の分野で急成長する会社が登場しています。iOSアプリケーションを通じて提供されるサービスを生み出し初期の競争を生き残った企業が、今の成熟したモバイル市場で大きな売上を生み出しているのと同じように、アプセサリも規模の拡大と成熟を迎えていくでしょう。

==== iOS独自のプロファイル

iOSは、iOS独自にいくつかのカスタム・プロファイルを公開しています。それらは、iOSにしか提供できないもので、iOSのユーザ体験をより豊かにするためのものです。

プロファイルの仕様が一般に公開 footnote:[Bluetooth for Developers, @<href>{https://developer.apple.com/bluetooth/} されているものは、次の2つです。これらは、MFiプログラムに参加してなくとも利用ができます:

- Apple Notification Center Service (ANCS)
- MIDI over Bluetooth low energy

つぎの4つのプロファイルは、MFiプログラムの中で提供されます:

- ゲームコントローラ
- iBeacon
- HomeKit

メールやソーシャルメディアの通知は、スマートフォン連携での定番の機能です。様ですが、々なアプリケーションからの通知情報は、ユーザのプライバシーの保護のために、iOSアプリケーションからは読み取れません。ですから、もしもiOSアプリケーションで通知機能を実現しようとすると、アプリケーション自体に様々なメールやソーシャルメディアの通知取得機能を実装しなくてはなりません。

Apple Notification Center Service (ANCS)、iOSデバイスに表示されている通知表示を、そのままBluetooth Smart機器に提供する機能です。ANCSを通じて、Bluetooth Smart機器は通知情報をiOSから直接取得できます。ANCSのおかげで、通知を取得するアプリケーションをいちいち作らなくても、通知を知らせるBluetooth Smart機器が開発できます。

MIDI（Musical Instrument Digital Interface、ミディ）は、電子楽器の演奏データを機器間でデジタル転送するための規格です。2012年にBluetooth low energy技術でMIDIデータをやり取りするカスタム・プロファイルが、2012年にApple Bluetooth low energy MIDIとして公開されました。この仕様は、2015年にMIDI本体の規格にそのまま取り込まれました footnote:[Specification for MIDI over Bluetooth Low Energy, @<href>{https://www.midi.org/specifications/item/bluetooth-le-midi}。

Apple Bluetooth low energy MIDIは、iOSに深く統合されています。楽器のデータは、人間が気づかない程度の小さな遅れ時間で送らなくてはなりません。そのために、この仕様は、データ形式に加えて、コネクション・インターバルを15ミリ秒以下の小さな値にすることを決めています。

iOSが通常受け入れるコネクション・インターバルは20ミリ秒以上ですが、Apple Bluetooth low energy MIDI対応機器は、15ミリ秒以下のコネクション・インターバルを受けつけます。また、この仕様に準じる機器は、CoreBluetoothフレームワークではなく音を扱うためのCoreAudioKitフレームワークを通じて、アプリケーションからは楽器として扱えます。

このようにiOSは、楽器演奏のユーザ体験に不可欠な小さな遅れ時間を、例外的な通信パラメータの受け入れで提供しています。また、Bluetoth Smart機器ではなく楽器としてアプリケーションから見えるようにしたことで、AppStoreにある数多くの演奏アプリケーションが活用できるようにしています。

iOSの独自プロファイルは、豊かなユーザ体験に不可欠の技術を、通信とiOSのみが実装できる機能それぞれを統合して提供しています。またカスタム・プロファイルはiOSが扱い、アプリケーションからは単なる周辺機器として見えるので、既存のアプリケーションが、そのまま利用できます。

==== Bluetooth low energyとビーコン

iBeacon footnote:[https://developer.apple.com/ibeacon/] は、iOS7で導入された新しい位置と近接の検出技術です。Bluetooth low energyのアドバタイジング・パケットをブロードキャストするビーコンと、iOSの常時ビーコン検出の機能を組み合わせて使います。屋内の経路案内や博物館の展示案内あるいは紛失物の探索などに利用できます。

ビーコン検出機能は、位置情報を提供する CoreLocationフレームワークを通じて一般開発者に提供されています。開発者は Bluetooth low energy を意識することなくiBeaconを利用できます。

iOSは強力なビーコン検出を提供します。iOSデバイスが再起動してもビーコン監視は継続します。さらに、ビーコンを検出した時にアプリケーションが終了状態であれば、iOSがアプリケーションを起動して検出イベントをアプリケーションに通知します。

ビーコンは、CoreLocationフレームワークとCoreBluetoothフレームワークを使いiOSアプリケーションを使ってiOSデバイスをビーコンにするか、またはiBeaconのハードウェア仕様にしたがって製造したビーコンを利用します。このiBeaconのビーコン技術仕様はMFiプログラムの対象です。

Bluetooth low energyのアドバタイジング・パケットは、どの程度の周期で送出されるかが事前にわからないので、通常は、アドバタイジング・パケットを検出する間は、2.4GHzの高周波受信回路を動かし続けます。ですから、単純にアドバタイジング・パケットを利用するビーコンを24時間監視すると、消費電力が無視できない大きさになります。

iBeaconは、ビーコンのアドバタイジング・インターバルを規定します。そしてiOSは、その技術仕様を前提にして、iOSデバイスのハードウェアとソフトウェアとを最適化して、消費電力を小さくしています。このビーコンとiOSとの統合された最適化ではじめて、ビーコンの常時検出が実現されています。

ビーコンは、任意に設定できる128ビットの識別子(UUID)と2つの16ビット値を送出できます。iOSアプリケーションは、検出対象のビーコンのUUIDを必ず指定しなければならないので、周囲にある任意のビーコンを検出することはできません。ですから、誰かが設置したビーコンの識別情報を盗みだすスニッフィングなどの悪用はできないようになっています。

iBeaconは、iOS標準アプリのPassbook footnote:[Passbook for Developers, @<href>{https://developer.apple.com/passbook/}](@<href>{https://developer.apple.com/passbook/}] が利用しています。ビーコンがあるとロック画面にパスが表示されます。

==== HomeKitとBluetooth low energy

HomeKit footnote:[@<href>{https://developer.apple.com/homekit/}] は、照明機器や電子錠などの身の回りにある機器とiOSデバイスとを、 Bluetooth low energy または Wi-Fi で連携させる技術です。HomeKitは、Siriを通じて自然な音声コマンドで機器が操作できるという、映画では見慣れた誰もが理解しているアプリケーションを提供しています。

機器が連携さえしていれば、サービス提供者やアプリケーション開発者が工夫して、多種多様なアプリケーションが新たな便利さや利用シーンを作り出されていきます。しかし、アプリケーションが登場するには、機器が連携してからしばらく時間がかかります。音声コマンドによる操作は、今はまだないサード・パーティのアプリケーションがなくとも、HomeKitを特徴づけるアプリケーションとなっています。

HomeKit は、機器開発のためのHomeKit対応機器の通信仕様と、iOSアプリケーション開発のための機器の登録や操作を提供する HomeKitフレームワークの2つで構成されます。HomeKit対応機器の開発は、MFiプログラムの対象です。HomeKitフレームワークは、一般開発者に開放されています。

電化製品を遠隔操作する技術は、古くから使われてきた技術です。例えば、1975年に開発された屋内電力配線で制御信号を送る技術X10は、電灯の遠隔操作パネルなどに欧米で広く使われています。X10のように専用制御装置を使うならば、すべての機器が屋内電力配線につながりますが、HomeKitではユーザはiOSデバイスを通じて機器とつながります。そのため、HomeKitは無線通信を使います。

電波は四方八方に広がるものなので、電化製品の無線化ではセキュリティの確保とプライバシーの保護が重要な課題になります。Bluetooth low energy にも、もちろんそれらの技術が盛り込まれていまが、HomeKitはそれらの技術は使っていません。HomeKitは、Bluetooth low energyを単にデータをやりとりするだけの無線通信として利用しています。セキュリティやプライバシーは、Apple社独自仕様で守られます。


== アプセサリを作るには、チームで、誰かに使ってもらう何かを

ここまで、Bluetooth low energy技術の特徴と、iOSデバイスを軸としたエコシステムを見てきました。ここでは、Bluetooth low energyを活用したアプセサリを生み出すにはどうすればよいかを見ていきます。

==== ハードウェアとその体験

アプセサリは、アクセサリとアプリケーションとの造語です。ですから、ハードウェアとしてのアクセサリが同じであっても、そこに掛け合わせるアプリケーションやサービスにより、様々なアプセサリが生み出されます。

アクセサリ、つまりハードウェア部分だけを見ると、既存の周辺機器がBluetooth Smart機器になるものと、Bluetooth low energy技術があるから初めて商品化できる機器とがあります。また機器のBluetooth low energy技術の役割は、それがなければならない必要な機能と、あってもなくてもよい追加機能であるものとに分類できます。

既存の周辺機器がBluetooth Smart機器になるものの例として、デジタル体重計があります。デジタル体重計は、Bluetooth low energy技術以前からある機器です。液晶パネルや電池があり、スマートホンがなくても単体で独立して使えます。そして、体重計の採択済みプロファイル Weight Scale Profile がありますから、これを採用してBluetooth Smart機器にできます。

もともと電子回路と電池があるデジタル体重計は、部品代がおよそ600円程度のBluetooth low energy技術の無線通信回路を追加すれば、Bluetooth Smart機器にできます。機器の工場出荷価格の目安は、およそ販売価格の3分の1です。ですから、販売価格が3000円から1万円のデジタル体重計の、工場出荷時の価格は1000円から3000円です。ですから、この600円の部品代は、けして安くはありません。

デジタル体重計にBluetooth low energy技術が、あってもなくてもよい追加機能か、必要不可欠の機能かは、組み合わせるアプリケーションやサービスで決まります。

昔から体重計を製造販売している会社であれば、低価格から高価格までの幅広い品揃えのうち、高価な部品が追加できる高価格帯の体重計にBluetooth low energy技術を付加します。これは、あってもなくてもよい機能です。また、フィットネスや体重管理のネットワーク・サービスを提供する会社であれば、自社のサービスと自然に連携させるために、Bluetooth low energy技術を採用します。これは、サービス連携のための必須機能です。

Bluetooth low energy技術を、追加機能にするか、必須機能にするかは、会社の方針から決まります。体重計という機器の製造販売が目的であれば、その会社は売上を増やし数多くの機器を販売するために、多種多様な体重計を製造販売します。Bluetooth low energy技術は、その多種多様な体重計の1つの追加機能にすぎません。

ですが、フィットネスなどのサービスが目的であれば、その会社はサービスをより魅力的にして多くの利用者の獲得が目的になります。ですから、体重計は、そのサービスのブランド・イメージに適した機種が1つあればよく、多種のものを販売する必要はありません。Bluetooth low energy技術は、サービスとの連携に必須です。

==== ブレインストーミングとプロトタイピング

アプセサリを、その体験に注目すると、ハードウェアとしての機器や、アプリケーションあるいはネットワーク・サービスの開発は、その体験を生み出すための大切な要素ですが、要素にすぎません。体験を生み出し、その体験を提供し続けるための事業を立ち上げるのは、チームにしかできません。

アプセサリの企画では、ブレインストーミングが役に立ちます。ブレインストーミングは、参加メンバーがアイディアを出しあい、そのアイディアを批判せず前向きに展開し続けることで、アイディアの連鎖反応や発想の誘発を期待する会議手法です。

また、ブレインストーミングには、プロトタイピングが活用できます。プロトタイピングは、試作品を作り早期に企画や体験の検証を短期間で繰り返す手法です。専門分野の異なるチームでは、メンバー同士の認識のすり合わせにプロトタイピングが有効です。

粘土をこねて外形を作ったり、あるいは目標とする機器とは大きさも形も違うとしても、例えばApple Watchのアプリケーションである程度の機能を作り、手で触れて動かして遊ぶと、驚くような発見や広がりそして展開につながります footnote:[Designing for Future Hardware, @<href>{https://developer.apple.com/videos/play/wwdc2015/801/}]。

==== センサー・デバイスと測定値

素晴らしいアプセサリを思いつこうとしても、とりかかりがなければ、考えようがありません。また、素晴らしいアプセサリの体験のアイディアが出ても、そのアクセサリが今ある技術で現実的な価格で製造可能でなければ、実現はできません。センサー・デバイスと測定値の知識は、実現可能なアプセサリを考える手がかりになります。

測定値は、ある量の大きさを計器、センサー、で測定して得られた値をいいます。世の中には様々な種類や精度のセンサーがありますが、圧力、温度、湿度、加速度、角速度、あるいは磁場などのセンサーがあります。センサー技術は絶えず進歩していて、驚くほどの高い感度や精度や機能がある新製品が登場しています。数センチメートルの高低差に相当する気圧変化が検出できる気圧センサーは、階段の昇降の検出すらできます。

最も身近なセンサーは、スマートホンに使われているものです。スマートホンに使われるセンサーは、大量生産されているので、高性能なものが安価に入手できます。例えば、スマートホンに使われるセンサーとその用途は次のものがあります。

* 磁気センサー
** コンパス
* 光センサー
** 画面の明るさ調整(照度センサー)
** 顔と画面の相対位置検出 (光学式近接センサー)
** 写真撮影 (イメージセンサー)
* 音センサー
** マイク
* 静電容量分布センサー
** タッチ検出
* 加速度、角速度、気圧センサー
** デバイスの向き検出
** 歩数や運動量の検出
* 気圧センサー
** 高度

アプセサリが提供するものは、利用者の体験です。ですから、センサーの計測値そのものではなく、その計測値が利用者の体験にどう関わるのかが重要です。センサーがどこに取り付けられているかが、計測値の意味を決めます。計測値がそのままで使うことは、あまりありません。いくつかの計測値を組み合わせたり、計測値を数値計算をして価値のある値を取り出したりします。

例えば、熱中症の危険を検出したいならば、気温だけではなく湿度も計測しなければなりません。またセンサーは、人の近くになければ意味が無いでしょう。あるいは、スマートホンのような常に携帯している機器では、その加速度は人の動きの情報そのものです。ですから、その加速度から歩数や消費カロリーの推定値を算出できます。

==== アクセサリのライフサイクルと収益

アプセサリはアクセサリとアプリケーションおよびサービスの2つの部分があります。アクセサリは、設計製造されて、流通し販売されて、利用され、そして破棄されて、そのライフサイクルを終えます。アプリケーションおよびサービスは、利用者から見ると、アクセサリを初めて購入した時点で利用が開始し、アクセサリを買い換えてもサービス利用は継続します。

ですから、アプセサリの売上は、アクセサリの売上と、アプリケーションおよびサービスの利用料金の2つです。したがって、売上を得る組み合わせは、アクセサリの売上のみでサービスは無料、アクセサリは無料でサービスは利用料金がかかかる、あるいはアクセサリの売上とサービスの利用料金がいずれもかかる、3つの組み合わせがあります。

フィットネス分野のアプせサリは、アクセサリの売上のみでサービスは無料のものが多くあります。それはアプセサリの売上にサービス利用料金を含めることに成功しているからです。単なる万歩計は1000円程度で販売されています。しかし、サービスと連携するBluetooth Smart機器の万歩計は5000円���くで販売されています。利用者がサービス連携の価値を認めることで、アクセサリの販売価格にサービス利用料金を含められています。

また、アプセサリのサービスをアクセサリの売上だけで運営維持していくためには、アクセサリかもしくはその消耗品が定期的に売れ続けなければなりません。フィットネス分野のアクセサリは、落下や洗濯による利用者のミスによる故障や、外装が汚れてくるなどで買い替えが期待できます。また、新しいデザインや新機能がある新モデルの定期的な投入も、買い替えにつながります。

あるいは、サービスのためのアクセサリならば、課金はサービス側で行い、より多くの人に使い始めてもらうために、アクセサリは実質無償とします。一般向けの決済サービスであれば、クレジットカードを読み取るアクセサリは安価で販売して、サービス利用時にその購入代金をポイントなどで利用者に戻して、実質無料で提供します。企業向けの勤怠管理システムであれば、まず利用を始めてもらえるように、機器はリースにして導入費用を低くして、利用料金で機器の費用を回収します。

アプセサリの事業規模は、利用者が増えるほど大きくなります。これには、アプセサリを知ってもらうこと、興味を持ってもらうこと、購入して利用してもらうことが必要です。フィットネス機器は、身につけている機器が他人から見えますから、、人のつながりと口コミで商品の認知が広まります。さらに、目標の活動量達成を自動的にソーシャル・メディアに投稿する機能があると、ネットワークを通じてもアプセサリの認知が広がります。

アクセサリには、ある場所に設置できるアクセサリは1つだけという場所の排他性と、あるアクセサリを利用していれば同様の別のアクセサリに入れ替えることはないという手間のための排他性とがあります。ですから、アプセサリの事業は、最初に利用されたものや、最初に導入されたものが強い立場を得ます。例えば、腕時計は2つ身につける人はいません。あるいは、企業向けのサービスであれば、別会社のサービスに切り替えることは、機材の入れ替えなど大変な手間がかかりますから、まずありません。

==== 開発とそのチーム

事業化を目指すアプセサリの開発は、ハードウェアやソフトウェアなど、いくつかの分野にまたがるために、その開発はチームでおこなうことになります。

プロジェクトは、アクセサリとサービスの試作などのプロトタイピングとその体験の確認の繰り返しに始まり、量産を前提とした試作、そしてサービスを開始してからは不良品対応やユーザー・サポートなどの運営へと進みます。プロジェクトの段階にともない、チームやその構成メンバーは変更されていきます。

プロトタイピングでは、分野を超えた連携が特に重要です。体験と設計そして実装とが、うまく組み合わさらないと、後の詳細実装で実装ができないことがわかりプロトタイピングからやり直しになり時間と費用を消耗したり、工夫をすれば実装ができることに気がづけずに、よい体験を逃したりします。分野を超えてお互いに工夫を出しあうことが重要です。

ハードウェアとアプリケーションが、それぞれ別の開発チームであるならば、チーム間での成果物の渡し方と渡す時期の設定に工夫が必要です。

チーム間で成果物を渡す時には、その成果物だけで動作が確認できるようにします。試作したハードウェアをアプリケーション開発チームに渡す時は、ハードウェアだけではなく、動作確認用のアプリケーションも渡すようにします。開発中にハードウェアの挙動がおかしい場合は、動作確認用アプリケーションがあれば、その原因がハードウェアなのか通信あるいはアプリケーションにあるのかを切り分けられます。

チームからチームへの成果物の公開は、ファイル共有やプロジェクト管理サービスを使い、常に行います。開発プロセスの1つを完成させてから次のプロセスを進める方法では、すべてのプロセスが直列に並び開発期間がとても長くなるのと、どこかで不具合が判明した時にその修正にかかる時間がとても長くなります。

試作が完了すれば、次に量産のための試作、そして製造へと移行します。製造設備を所有していなければ、製造ができるパートナーも見つけ出さなければなりません。体験のための試作と、量産のための試作は異なります。製造のしやすさや製造費用の低減はもちろん、人への安全性などのリスク分析や、説明書への記載、リサイクルや環境への配慮などの、市場で販売するために必要な考慮が含まれます。

また、Made for iPhoneプログラムには、設計者ライセンスと製造者ライセンスがあります。iBeaconのように、iOS独自の認証技術が用いられていないものでは、通常のBluetooth Smart機器として製造ができます。ですが、HomeKitのように高度な認証技術が使われるものは、Made for iPhoneの製造者ライセンスを取得している製造パートナーを探します。

==== 電波法とBluetoothの認証

市場で販売される機器には、機器がお互いに機能できるように、認可や申告の義務があります。電波を送信するBluetooth Smart機器には、電波法の遵守と、Bluetooth無線技術の認可の取得と製品申告が必要です。

電波は公共の資源です。電波は四方八方に広がるため、混信や妨害が起きないように、国が周波数の割当や事業者への割当をおこないます。Bluetooth Smart機器は、電波を送信するので、小さいながらも無線局です。電波法に従わない勝手な無線設備の運用には、罰則規定があります footnote:[電波法 第百十条 次の各号のいずれかに該当する者は、一年以下の懲役又は百万円以下の罰金に処する。]。

無線技術の知識がない人が免許がなくても利用できるように、無線設備を電波法に適合するものとして認証する制度があります。これが、技術基準適合証明制度(技適)および工事設計認証制度です。

技術基準適合証明制度は、無線設備を1台づつ試験をして技術基準に適合しているかを判断して認証するもので、1回の申請で最大500台まで申請できます。これは、試作あるいは少数製造で利用されます。

製造では、工事設計認証制度が使われます。これは、無線設備の設計とその製造設備が基準を満たすことを認証します。この制度は、同じ特性の無線設備が製造できる工場で製造された1台の無線設備を試験して、その1台が技術基準に適合してれば、これから同じ特性で製造される無線設備も技術基準を満たすだろうというものです。

これらの制度を利用しても、製品ごとに認可を取るのは大変です。そこで使われるのがモジュール状の特定無線設備、つまり無線モジュールです。無線モジュールとは、発振部などの電波の特性に直接影響を与える部分を1つの基板や集積回路にまとめたものです。無線モジュールで、技術基準適合証明または工事設計認証を取得していれば、無線モジュールを組み込んだ最終製品で認証を取得する必要はありません。

ですから、Bluetooth Smart機器の試作と量産では、無線モジュールがよく使われます。しかし、無線モジュールが使えない小型や曲面のように特殊な形状のものでは、無線回路から設計します。このときは、電気回路の設計と試作ではシールドボックスやシールドルームという、電波を外に漏らさない箱や部屋で試験をします。また屋外で体験を検証するときは技術基準適合証明を、製造時は工事設計認証を製品に対して取得します。

電波法は国ごとに異なります。Bluetooth Smart機器を米国で販売するには、通信や電波の利用を管理する連邦通信委員会(Federal Communication Commission、FCC)の認証の取得が必要です。これには、日本国の技術基準にはない、機器から意図せず放射される電磁波の強度測定が含まれます。

このように、電波法の基準やその認証制度とその運営は国ごとに異なります。どのような試験項目があるのかは設計段階から把握し対応しなければ、試験に通らず再設計することになります。また、1回の測定で複数の国に提出できるデータを取得できるものもあります。ですから、量産のための試作では、認証サービス会社や製造パートナーと、事前にどの国で販売するかを設定して、技術評価項目を確認しておきます。

Bluetooth機器を自社製品として販売するには、Bluetoothの認可を取得して製品申告をします。これには、Bluetooth無線技術の知的財産と商標のライセンシングが含まれます footnote:[Bluetooth 認証および申告プロセス @<href>{https://www.bluetooth.org/ja-jp/test-qualification/qualification-overview}。
申告料金は、アソシエイトメンバーであれば4,000米ドル、年会費が無償のアダプターメンバーであれば8,000米ドルです。年間収入が1億米ドル以下の中小企業のアソシエイト会員の年会費は7,500米ドルですから、1年間に2つ以上の製品を登録するならば、アソシエイトメンバーになる方が得です。

また、小さな新興企業が最初のBluetooth製品を商品化できるように、イノベーション奨励プログラムがあります。年間収入が100万米ドル未満で、以前に申告をしたことがない企業は、2,500米ドルの割引金額で最大2つの申告を受けることができます。

=== {ch01-まとめ} まとめ

この章は、利用場面を例にして、Bluetooth low energy技術の特徴とそのエコシステムとを見ていきました。無線通信には必ず通信相手がいます。ですから、通信相手がそれぞれ普及しないかぎり、新しい無線技術は普及しはじめません。Bluetooth low energy技術は、スマートホンという通信相手の登場により、急激に普及しはじめました。

従来版Bluetooth無線技術は、無線通信と機器のデータ表現を組み合わせて最適な技術を提供していました。ですが、Bluetooth low energy無線技術は、ものをデータベースとして表現する、通信を意識しなくてもよい、GATT 基盤アーキテクチャを採用しました。

Bluetooth low energy技術のエコシステムは、機器の製造販売、アプリケーション開発、そしてサービス提供といった、事業の目的も利益も違う事業者の関わりあいで支えられます。Bluetooth low energy技術は、このエコシステムのつながりのよりどころなのです。

Bluetooth SIGの採択済みプロファイルをよりどころにして、周辺機器やフィットネスなどの機器市場へのBluetooth low energy技術の普及をみてきました。そして、カスタム・プロファイルとアプリケーション開発がもたらしたアプセサリと呼ばれる新しい利用分野を見てきました。

Bluetooth low energy技術は、その強力なブランド力で、身の回りにある様々な物と物事のための無線通信技術として、ますます普及していくでしょう。

